Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_17 (Conv2D)           (None, 224, 224, 32)      896       
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 224, 224, 32)      9248      
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 112, 112, 32)      0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 112, 112, 64)      18496     
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 112, 112, 64)      36928     
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 56, 56, 64)        0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 56, 56, 128)       73856     
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 56, 56, 128)       147584    
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 28, 28, 128)       0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 28, 28, 256)       295168    
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 28, 28, 256)       590080    
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 14, 14, 256)       0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 50176)             0         
_________________________________________________________________
dense_7 (Dense)              (None, 256)               12845312  
_________________________________________________________________
dropout_5 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_8 (Dense)              (None, 256)               65792     
_________________________________________________________________
dropout_6 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 5)                 1285      
_________________________________________________________________
activation_3 (Activation)    (None, 5)                 0         
=================================================================
Total params: 14,084,645
Trainable params: 14,084,645
Non-trainable params: 0
_________________________________________________________________
